acaballero/etherlab/lib/ST77XX-STM32/Display_afb.cpp
            if (this->curr_buffer == b565_buffer) {

                // The first half of the RGB buffer is ready to be transferred
                // If DMA is ready (second half has been transferred, so state == READY), we start another transfer now

                this->curr_buffer = b565_buffer + half_dma_buffer_size;

                if (this->use_dma) {
                    //GPIOD->BSRR |= GPIO_PIN_5;
                    while (HAL_SPI_GetState(spi_port) != HAL_SPI_STATE_READY);
                    //GPIOD->BSRR |= GPIO_PIN_5<<16;
                    this->DMAHalfTransferCompleted = false;
                    HAL_SPI_Transmit_DMA(spi_port, ((uint8_t *) b565_buffer), dma_transfer_length);
                }
            } else {

                // The second half of the RGB buffer is ready
                // Wait for the first half of the buffer to be transferred before start again

                this->curr_buffer = b565_buffer;

                if (this->use_dma) {
                    while (!this->DMAHalfTransferCompleted);
                }

                // The last chunk may need fewer bytes to transfer
                if (area->height - this->current_line < this->chunk_height << 1) {
                    dma_buffer_size = (area->height - this->current_line) * area->width;
                    dma_transfer_length = dma_buffer_size << 1;
                }
            }
        }

        if (this->use_dma) {
            while (HAL_SPI_GetState(spi_port) != HAL_SPI_STATE_READY);
            EndDisplayDataTransfer();
        } else {
            DISP_DC_PORT->BSRR |= DISP_DC_PIN << 16; // DC PIN UNSET
        }

        this->drawing = false;
    }
}

void Display::DMATxHalfCpltCallback(void) {
    this->DMAHalfTransferCompleted = true;
    // GPIOB->BSRR= GPIO_PIN_5 << 16;
}

void Display::DMATxCpltCallback(void) {
}

uint16_t Display::getColor() {
    return this->color;
}

void Display::fillBuffer(uint16_t c) {
    for (uint16_t i = 0; i < this->chunk_height * this->curr_area->width; i++) {
        *(curr_buffer + i) = c;
    }
}

void Display::fill(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t c) {

    Area *area = this->curr_area;
    uint16_t zy1 = this->current_line;
    uint16_t zy2 = min2(this->current_line + this->chunk_height, area->height);

    if (y2 >= zy1 && y1 < zy2) { // There's something to draw in the current chunk

        y1 = max2(y1, this->current_line);
        uint16_t dy1 = y1 - this->current_line;
        uint16_t dy2 = y2 - this->current_line;
        uint16_t is = dy1 * this->curr_area->width + x1;

        uint16_t ie = min2(this->chunk_height * this->curr_area->width, dy2 * this->curr_area->width + x2);
        uint16_t di = this->curr_area->width - (x2 - x1);
        uint16_t x = x1;

        while (is < ie) {
            while (x++ < x2) {
                *(curr_buffer + is) = c;
                is++;
            }
            is += di;
            x = x1;
        }
    }
}

void Display::setPixel(uint16_t x, uint16_t y, uint16_t c) {

    // Have in mind this function is too slow (around 17 assembler instructions) to call
    // it within a area drawing callback function (in which you have around 18 instructions to draw a pixel ( 72Mhz(core) / ( 18Mhz(spi) * 16 (bits/pixel) ) / 4 (cycles per instruction, but can be slower due to bus waiting) )
    // So, if we have to fill a area, use the buffer (getBuffer) instead with incremental offset
    Area *area = this->curr_area;

    if (y >= this->current_line && y < this->current_line + this->chunk_height) {

        uint16_t dy = y - this->current_line;

        // index of the pixel in the DMA buffer
        uint16_t ix = ((dy * area->width) + x); // >> buffer->log2_pixels_per_byte;

        *(curr_buffer + ix) = c;
    }
}

void Display::writeLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {
    writeLine(x1, y1, x2, y2, this->color);
}

void Display::writeVertLine(uint16_t x, uint16_t y1, uint16_t y2, uint16_t color) {

    int y = y1;
    if (y1 > y2) {
        y2 = y1;
        y = y2;
    }

    Area *area = this->curr_area;

    uint16_t delta = area->width;

    if (y2 >= this->current_line && y < this->current_line + this->chunk_height) {

        y2 = min2(this->current_line + this->chunk_height - 1, y2);
        y = max2(this->current_line, y);

        uint16_t dy = y - this->current_line;
        uint16_t ix = dy * delta + x;

        while (y <= y2) {

            *(curr_buffer + ix) = color;

            y++;
            ix += delta;
        }
    }
}

void Display::writeLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color) {
    this->writeLine(x1, y1, x2, y2, color, 1);
}

void Display::writeLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color, uint8_t width) {

    Area *area = this->curr_area;

    uint16_t zy1 = this->current_line;
    uint16_t zy2 = this->current_line + this->chunk_height;

    if (y1 > y2) {
        uint16_t aux = y1;
        y1 = y2;
        y2 = aux;
        aux = x1;
        x1 = x2;
        x2 = aux;
    }

    if (y2 >= zy1 && y1 < zy2) { // There's something to draw in the current chunk

        /* Fastest line drawing algorithm (supporting all slopes) I've encountered so far (http://www.edepot.com/linee.html) */
        bool yLonger = false;
        volatile int shortLen = y2 - y1;
        volatile int longLen = x2 - x1;
        if (abs(shortLen) > abs(longLen)) {
            int swap = shortLen;
            shortLen = longLen;
            longLen = swap;
            yLonger = true;
        }
        int decInc;
        if (longLen == 0) decInc = 0;
        else decInc = (shortLen << 16) / longLen;

        uint16_t ipx = x1;
        uint16_t ipy = y1;

        if (yLonger) {
            if (longLen > 0) {
                longLen += ipy;
                for (int j = 0x8000 + (x1 << 16); ipy <= longLen; ++ipy) {
                    if (ipy >= zy1 && ipy < zy2) {
                        ipx = (ipy - this->current_line) * area->width; // offset in the buffer
                        *(this->curr_buffer + ipx + (j >> 16)) = color;
                    }

                    j += decInc;
                }
                return;
            }
            longLen += ipy;
            for (int j = 0x8000 + (x1 << 16); ipy >= longLen; --ipy) {
                if (ipy >= zy1 && ipy < zy2) {
                    ipx = (ipy - this->current_line) * area->width; // offset in the buffer
                    *(this->curr_buffer + ipx + (j >> 16)) = color;
                }

                j -= decInc;
            }
            return;
        }

        // xLonger
        if (longLen > 0) {
            for (int j = 0x8000 + (y1 << 16); x1 <= x2; ++x1) {
                ipy = (j >> 16);
                if (ipy >= zy1 && ipy < zy2) {
                    ipx = (ipy - this->current_line) * area->width; // offset in the buffer
                    *(this->curr_buffer + ipx + x1) = color;
                }
                j += decInc;
            }
            return;
        }

        for (int j = 0x8000 + (y1 << 16); x2 >= x1; --x2) {
            ipy = (j >> 16);
            if (ipy >= zy1 && ipy < zy2) {
                ipx = (ipy - this->current_line) * area->width; // offset in the buffer
                *(this->curr_buffer + ipx + x2) = color;
            }
            j -= decInc;
        }


        /* Simpler, but slower line drawing algorithm */
//        uint16_t t;
//        int16_t xerr = 0, yerr = 0, delta_x, delta_y, distance;
//        int8_t incx, incy;
//        uint16_t uRow, uCol, y;
//
//        delta_y = y2 - y1;
//        delta_x = x2 - x1;
//
//        uRow = x1;
//        uCol = y1 - area->current_line;
//        y = y1;
//
//        if (delta_x > 0)
//            incx = 1;
//        else if (delta_x == 0)
//            incx = 0;
//        else {
//            incx = -1;
//            delta_x = -delta_x;
//        }
//
//
//        if (delta_y > 0)
//            incy = 1;
//        else if (delta_y == 0)
//            incy = 0;
//        else {
//            incy = -1;
//            delta_y = -delta_x;
//        }
//
//        if (delta_x > delta_y)
//            distance = delta_x;
//        else
//            distance = delta_y;
//
//        uint16_t ay = uCol * area->width;
//        for (t = 0; t <= distance; t++) {
//
//            if (y >= zy1 && y <= zy2) {
//
//                uint16_t ix = (ay + uRow); // >> buffer->log2_pixels_per_byte;
//
//                *(this->curr_buffer + ix) = color;
//            }
//
//            xerr += delta_x;
//            yerr += delta_y;
//            if (xerr > distance) {
//                xerr -= distance;
//                uRow += incx;
//            }
//            if (yerr > distance) {
//                yerr -= distance;
//                uCol += incy;
//                ay +=  area->width;
//                y += incy;
//            }
//
//
//        }
    }
}

void Display::writeRect(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {
    //select();
    writeRect(x1, y1, x2, y2, C565_WHITE);
}

void Display::writeRect(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color) {
    //select();
    writeLine(x1, y1, x2, y1, color);
    writeLine(x1, y1, x1, y2, color);
    writeLine(x1, y2, x2, y2, color);
    writeLine(x2, y1, x2, y2, color);
    //Unselect();
}

void Display::drawCircle(uint16_t x0, uint16_t y0, uint8_t r, uint16_t color) {
    //select();
    int16_t f = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -2 * r;
    int16_t x = 0;
    int16_t y = r;

    setPixel(x0, y0 + r, color);
    setPixel(x0, y0 - r, color);
    setPixel(x0 + r, y0, color);
    setPixel(x0 - r, y0, color);

